{
  "basics": {
    "name": "William Dean",
    "label": "Analytics Engineer | Workday Prism Analytics | Java SQL Reporting & ETL Specialist",
    "phone": "(585) 465-1690",
    "email": "williamdean19@gmail.com",
    "location": {
      "city": "Rochester",
      "state": "NY",
      "country": "US"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "willdean1",
        "url": "https://linkedin.com/in/willdean1"
      },
      {
        "network": "GitHub",
        "username": "williamdean19",
        "url": "https://github.com/williamdean19"
      }
    ]
  },
  "work": [
    {
      "company": "Medical University of South Carolina",
      "position": "Workday Custom Report and Prism Analytics Developer",
      "location": "Rochester, NY - Remote",
      "startDate": "2023-02",
      "endDate": "2024-10",
      "highlights": [
        "Led the development of a multi-source data pipeline integrating Epic EMR, Kronos, Axiom, and Workday data, improving workforce productivity tracking for 1600+ cost centers and processing over 42 million labor hours.",
        "Engineered data pipelines that unified diverse systems into a single reliable source, enhancing reporting accuracy and empowering leadership with actionable insights.",
        "Managed the migration of over 12 million rows of legacy data into a unified Workday Prism Analytics data source, simplifying data access and reporting across departments.",
        "Developed over 100 advanced matrix and composite reports across payroll, HCM, and recruiting functional areas.",
        "Created detailed reports at the cost center and employee levels for payroll earnings and deductions by type.",
        "Generated quarterly job application, new hire, and termination count reports for Vizient reporting.",
        "Built a dashboard tracking employee turnover trends, including terminations by type, year, and reason, as well as attrition rates by location.",
        "Designed metrics for months of continuous service at termination and terminations within 1, 3, 6, 12, and 18 months of hire.",
        "Collaborated closely with cross-functional teams ensuring the development of custom reports, dashboards, and KPIs that met the business needs of non-technical stakeholders."
      ]
    },
    {
      "company": "University of Rochester",
      "position": "Sr. Workday Report Developer",
      "location": "Rochester, NY - Remote",
      "startDate": "2021-02",
      "endDate": "2023-02",
      "highlights": [
        "Executed the deployment of Workday HCM data reporting for Highland Hospital benefiting approximately 5000 employees and prepared for expansion to the entire University employing around 35000 individuals.",
        "Partnered with Huron consultants to guarantee data consistency during the transition from the legacy system to Workday, interpreting and meeting technical requirements for more than 40 key reports in HCM and Payroll functional areas.",
        "Deployed W-2 and W-2C data extraction for all Highland Hospital workers via Prism Analytics supporting employment data validation with the Social Security Administration.",
        "Customized BIRT paycheck layout using Workday Studio for over 4000 Highland Hospital workers with users executing the solution over 5000 times in the first six months from go-live.",
        "Designed BIRT supplier payment checks to bank acceptance criteria specifications using Workday Studio, enabling electronic vendor payments through the Workday application.",
        "Developed a Workday financial dashboard to monitor and manage over $64 million in grant award funding."
      ]
    },
    {
      "company": "MVP Health Care",
      "position": "SQL Reporting Analyst",
      "location": "Rochester, NY - Remote",
      "startDate": "2020-01",
      "endDate": "2020-11",
      "highlights": [
        "Devised an on-demand solution for database migration, identifying discrepancies between server instances with SQL object definitions and hash algorithms.",
        "Upgraded and maintained SSIS ETL workflows ensuring seamless data integration into the SQL reporting environment.",
        "Managed SQL queries and procedures for the Facets insurance claim submission application providing reliable data reporting.",
        "Encouraged and enacted process improvements leading to considerable time savings and increased team productivity."
      ]
    },
    {
      "company": "Coordinated Care Services Inc. (OMH/HHUNY)",
      "position": "Data Analyst / SQL Developer",
      "location": "Rochester, NY",
      "startDate": "2016-05",
      "endDate": "2020-01",
      "highlights": [
        "Prevented loss of $1.6 million in unused state aid through strategic data analysis and reallocation of provider surplus and deficits.",
        "Processed daily billing for the Health Homes of Upstate NY (HHUNY) network with SSIS workflows, adjusting workflows as needed for governmental reporting changes.",
        "Engineered a data pipeline using SQL and Alteryx enabling near real-time tracking for over $35M in budget data from over 40 providers across 100+ programs.",
        "Built and deployed interactive Tableau dashboards, refreshing data with daily workflow execution.",
        "Developed a GUI application in Microsoft Access with a SQL Server back end utilizing VBA as the middle layer to support the 'Gap In Care' initiative.",
        "Interpreted and structured reports to meet evolving governmental requirements aiding over 40 healthcare organizations in adapting to changing data environments."
      ]
    },
    {
      "company": "SUNY Research Foundation",
      "position": "Research Analyst / Java Programmer", 
      "location": "Brockport, NY",
      "startDate": "2016-01",
      "endDate": "2016-05",
      "highlights": [
        "Engineered a scalable Java application analyzing vehicle usage viability, processing 82,000+ trip records across 13,000+ households to inform sustainable transportation policy",
        "Designed object-oriented data pipeline integrating household surveys, vehicle data, and trip segments, with robust validation for data integrity and pattern analysis",
        "Developed statistical models comparing charging strategies (slow vs. fast charging), demonstrating 85% of trips could be completed with 40-mile range EVs",
        "Implemented custom algorithms to identify and analyze complex travel patterns including multi-stop journeys, vehicle sharing, and varied charging scenarios"
      ]
    }
  ],
  "education": [
    {
      "institution": "SUNY Brockport",
      "location": "Brockport, NY",
      "studyType": "B.S.",
      "area": "Computer Science (Software Engineering Track)",
      "startDate": "2014",
      "endDate": "2017",
      "honors": [
        "Brockport Math and Computer Science Scholarship for three consecutive semesters",
        "President’s List Honor’s Fall-14",
        "Dean’s List Fall-15 and Spring-16"
      ]
    },
    {
      "institution": "SUNY Geneseo",
      "location": "Geneseo, NY",
      "studyType": "B.A.",
      "area": "Mathematics",
      "endDate": "2010",
      "honors": []
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "keywords": [
        "Java",
        "C#",
        "SQL",
        "T-SQL",
        "Python"
      ]
    },
    {
      "name": "Data & ETL",
      "keywords": [
        "SSIS",
        "SSRS",
        "SQL Server",
        "Alteryx",
        "Tableau"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "VS Code",
        "Eclipse",
        "Jira",
        "ServiceNow",
        "TFS",
        "Microsoft 365"
      ]
    }
  ],
  "certifications": [
    {
      "name": "Workday Pro: Prism Analytics Certification",
      "date": "2024-09",
      "url": "https://www.credly.com/badges/692c255d-964a-4582-8a18-eeeab0a9f8df"
    },
    {
      "name": "Configurable Security Fundamentals",
      "date": "2024-07"
    },
    {
      "name": "Workday Extend: Advanced Data and Orchestration Services",
      "date": "2024-03"
    },
    {
      "name": "Workday Extend: Advanced Presentation Components",
      "date": "2024-02"
    },
    {
      "name": "Workday Extend Fundamentals",
      "date": "2024-01"
    },
    {
      "name": "Prism Analytics",
      "date": "2022-02"
    },
    {
      "name": "Composite Reporting Fundamentals",
      "date": "2021-05"
    },
    {
      "name": "Calculated Fields",
      "date": "2021-02"
    },
    {
      "name": "Report Writer",
      "date": "2021-02"
    },
    {
      "name": "Certified in Agile Software Development: Clean Coding Practices",
      "date": "2020-10"
    }
  ],
  "projects": [
    {
      "name": "Spring Boot Web Application",
      "description": "Created REST API endpoints for managing employee and compensation data using Spring Boot and MongoDB.",
      "highlights": [
        "Created a ReportingStructure type to calculate the total number of direct and indirect reports for an employee using a recursive approach."
      ],
      "url": "https://github.com/williamdean19/mindex-challenge"
    },
    {
      "name": "Automated Resume Pipeline",
      "description": "Created git-based automated resume deployment system",
      "highlights": [
        "Built version-controlled resume system using JSON for structured data and git for change tracking and history management",
        "Implemented GitHub Actions workflow to automatically sync repository updates to Gist, enabling continuous deployment to JSONResume.org",
        "Leveraged GitHub's infrastructure for secure secret management and automated file synchronization",
        "Standardized resume updates through programmatic JSON manipulation, eliminating manual formatting overhead"
      ],
      "keywords": [
        "GitHub Actions",
        "Git", 
        "JSON",
        "YAML",
        "Automation"
      ],
      "url": "https://github.com/williamdean19/will_dean_resume"
    }
  ]
}
